{
  "features": [
    {
      "title": "Customizable New Tab Dashboard",
      "screenshot": "/sesh/screenshots/newtab-dashboard.png",
      "description": "Transform your new tab page into a <span style='color: #92ff07'>personal productivity hub</span>. Choose from multiple beautiful themes including Ninja, Geometry, Zen, and Earth backgrounds. Add widgets like analog/digital clocks, countdown timers, quick links, search bars, and text notes to create your perfect workspace."
    },
    {
      "title": "Powerful Sessions Management",
      "screenshot": "/sesh/screenshots/sessions-widget.png", 
      "description": "The heart of Sesh - manage all your <span style='color: #92ff07'>tabs, windows, and bookmarks</span> in one intuitive interface. Drag and drop tabs between windows, organize them into custom folders, and never lose track of important pages again. Available both as a widget on your new tab page and as a popup (Alt/Option + S)."
    },
    {
      "title": "Smart Bookmark Organization", 
      "screenshot": "/sesh/screenshots/bookmarks-sidebar.png",
      "description": "Create custom bookmark folders and <span style='color: #92ff07'>drag tabs directly into them</span>. Search through your saved tabs, organize by projects or topics, and access everything with a single click. No more digging through cluttered bookmark bars."
    },
    {
      "title": "Advanced Tab Operations",
      "screenshot": "/sesh/screenshots/tab-operations.png",
      "description": "Bulk select tabs across multiple windows, <span style='color: #92ff07'>move them between windows</span>, close multiple tabs at once, or save entire browsing sessions. Pin important tabs, mute noisy ones, and keep your browser organized effortlessly."
    },
    {
      "title": "Window Synchronization",
      "screenshot": "/sesh/screenshots/window-sync.png", 
      "description": "Sync browser windows with bookmark folders for <span style='color: #92ff07'>automatic organization</span>. When you add or remove tabs from a synced window, the corresponding bookmark folder updates automatically. Perfect for project-based browsing."
    },
    {
      "title": "Quick Search & Navigation",
      "screenshot": "/sesh/screenshots/search-features.png",
      "description": "Find any tab or bookmark instantly with <span style='color: #92ff07'>powerful search functionality</span>. Search across all open tabs, bookmark folders, and saved sessions. Navigate with keyboard shortcuts and jump to any page in seconds."
    },
    {
      "title": "Session Backup & Restore", 
      "screenshot": "/sesh/screenshots/session-restore.png",
      "description": "Never lose your work again. <span style='color: #92ff07'>Save entire browsing sessions</span> as bookmark folders, and restore them later with a single click. Perfect for research projects, work sessions, or when you need to switch contexts."
    },
    {
      "title": "Flexible Widget System",
      "screenshot": "/sesh/screenshots/widget-customization.png",
      "description": "Customize your dashboard with a variety of widgets: <span style='color: #92ff07'>pinned bookmarks, search engines, countdown timers, clocks, and custom text notes</span>. Resize, reposition, and configure each widget to match your workflow perfectly."
    },
    {
      "title": "Popup Interface & Quick Access",
      "screenshot": "/sesh/screenshots/popup-interface.png",
      "description": "Access Sesh instantly with <span style='color: #92ff07'>Alt/Option + S</span> from anywhere in your browser. The compact popup interface gives you full control over tabs, windows, and bookmarks without leaving your current page. Perfect for quick organization on the go."
    }
  ]
} 